# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 Stereo 3D Detection with group-conv stem + stereo cost volume
# The cost volume taps features from backbone layer 1 (groups=2, stride 4),
# builds dot-product correlation at 24 disparity offsets (0..48 feature pixels),
# refines + downsamples to stride 8, then concatenates with P3 features.
# Usage: model=yolo11n-stereo3ddet-costvol.yaml

# Parameters
nc: 3
stereo: true
input_channels: 6
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

training:
  loss_weights:
    lr_distance: 2.0
    depth: 1.0
    dimensions: 1.0
    orientation: 1.0

mean_dims:
  Car: [3.88, 1.63, 1.53]
  Pedestrian: [0.88, 0.60, 1.73]
  Cyclist: [1.72, 0.60, 1.77]

# YOLO11 backbone -- group-conv stem (groups=2 for layers 0-1)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2, None, 2]]  # 0-P1/2  groups=2: left/right independent
  - [-1, 1, Conv, [128, 3, 2, None, 2]] # 1-P2/4  groups=2: left/right independent
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2       L/R features merge here
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

# YOLO11 head with stereo cost volume
head:
  # Top-down FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]         # 13
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]         # 16 (P3/8 FPN output)

  # Stereo cost volume from backbone layer 1 (groups=2, stride 4)
  # StereoCostVolume args: [out_ch, max_disp, num_bins]
  - [1, 1, StereoCostVolume, [64, 48, 24]]  # 17: cost vol → [B, 64, H/8, W/8]
  - [[-1, 16], 1, Concat, [1]]              # 18: merge cost vol + P3
  - [-1, 1, Conv, [256, 1]]                 # 19: reduce channels (new P3)

  # Bottom-up PAN
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]         # 22 (P4/16)
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]         # 25 (P5/32)

  # Multi-scale head
  - [[19, 22, 25], 1, Stereo3DDetHeadYOLO11, [nc]]
