# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics RT-DETR (DINOv3-s) with STA dual-path fusion and DEIMv2-like hybrid encoder head
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes

backbone:
  # [from, repeats, module, args]
  # DEIMv2 DINOv3+STA backbone wrapper.
  # Parser args: [out_ch, name, pretrained, interaction_indexes, finetune, patch_size, use_sta, conv_inplane, hidden_dim, split]
  # If pretrained=True, loader uses official DINOv3 torch.hub URL by model name.
  # For access-gated links, set DEIMV2_DINOV3_URL to your granted direct checkpoint URL.
  - [-1, 1, DEIMDINOv3STAs, [224, dinov3_vits16, True, [5, 8, 11], True, 16, True, 32, 224, True]] # 0
  - [0, 1, Index, [224, 1]] # 1 P3
  - [0, 1, Index, [224, 2]] # 2 P4
  - [0, 1, Index, [224, 3]] # 3 P5

head:
  # DEIMv2-large-like HybridEncoder head: input_proj + AIFI + FPN/PAN.
  - [3, 1, Conv, [224, 1, 1, None, 1, 1, False]] # 4 input_proj.2
  - [-1, 1, AIFI, [896, 8]]
  - [-1, 1, Conv, [224, 1, 1, None, 1, 1, False]] # 6 Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, Conv, [224, 1, 1, None, 1, 1, False]] # 8 input_proj.1
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [224, 448, 112, 3]] # 10 fpn_blocks.0
  - [-1, 1, Conv, [224, 1, 1, None, 1, 1, False]] # 11 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [1, 1, Conv, [224, 1, 1, None, 1, 1, False]] # 13 input_proj.0
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [224, 448, 112, 3]] # 15 X3, fpn_blocks.1

  - [-1, 1, SCDown, [224, 3, 2, False]] # 16 downsample_convs.0
  - [[-1, 11], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [224, 448, 112, 3]] # 18 F4, pan_blocks.0

  - [-1, 1, SCDown, [224, 3, 2, False]] # 19 downsample_convs.1
  - [[-1, 6], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [224, 448, 112, 3]] # 21 F5, pan_blocks.1

  # RTDETRDecoder - [nc, ch, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale, learnt_init_query]
  - [[15, 18, 21], 1, RTDETRDecoder, [nc, 224, 300, 4, 8, 4, 1792, 0.0, "silu", -1, 100, 0.5, 1.0, False, True]]

loss:
  gamma: 2.0
  alpha: 0.75
  loss_gain: {class: 1, bbox: 5, giou: 2}
  matcher:
    cost_gain: {class: 2, bbox: 5, giou: 2}
