# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-nexta-cls: adds PSABlock attention at P4 (14x14) inside C3k2
# Usage: yolo classify train model=yolo26s-nexta-cls.yaml
# +1.3% params vs yolo26-cls at s-scale (6.81M vs 6.72M)

# Parameters
nc: 1000
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True, 0.5, True]] # 6 - attn=True at P4 (14x14)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 2, C2PSA, [1024]] # 9

head:
  - [-1, 1, Classify, [nc]]
